tap "dart-lang/dart"
tap "elastic/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "lokalise/brew"
tap "mongodb/brew"
tap "sambadevi/powerlevel9k"
tap "sass/sass"
tap "wpscanteam/tap"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Core application library for C
brew "glib"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# OpenType text shaping engine
brew "harfbuzz"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Secure Reliable Transport
brew "srt"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# Geometry Engine
brew "geos"
# GNOME XML library
brew "libxml2"
# Framework for scientific data networking
brew "libdap"
# Postgres C API library
brew "libpq"
# Package for scientific computing with Python
brew "numpy"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler-qt5"
# Geospatial Data Abstraction Library
brew "gdal"
# File compressor
brew "lzop"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# HTTP/2 C Library
brew "nghttp2"
# Platform built on V8 to build network applications
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# Cross-platform application and UI framework
brew "qt"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql", restart_service: true
# Object-relational database system
brew "postgresql@12"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Watch files and take action when they change
brew "watchman"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Distributed search & analytics engine
brew "elastic/tap/elasticsearch-full"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Lokalise CLI Tool - API client binary
brew "lokalise/brew/lokalise"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# A badass zsh theme with more power than a normal earthling
brew "sambadevi/powerlevel9k/powerlevel9k"
# Stylesheet Preprocessor
brew "sass/sass/sass"
# Black box WordPress vulnerability scanner
brew "wpscanteam/tap/wpscan"
# Voice and text chat software
cask "discord"
# Web browser
cask "firefox"
cask "font-hack-nerd-font"
# HTTP and GraphQL Client
cask "insomnia"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
